; яОЕЖХЮКХГХПНБЮММЮЪ РЮАКХЖЮ ЙНЩТТХЖХЕМРНБ ОНБЕПУМНЯРЕИ
; УЮПЮЙРЕПХГСЧЫЮЪ ЛНЛЕМР юд Б ТСМЙЖХХ МЮОПЪФЕМХЪ, РНЙЮ
; Х СЦКЮ МЮЦПСГЙХ.

; оНДДЕПФХБЮЕРЯЪ ЯНБЛЕЯРМНЕ ХЯОНКЭГНБЮМХЕ Я РХОНЛ ПЮЯВЕРЮ ЛНЛЕМРЮ CUB(3 ОНБЕПУМНЯРХ)
 ;---------------------------------------------------------------------------
 ;   лЮЯЯХБ		|мНЛ. ЛНЛЕМР| iПЕД | рХО   |  рХО	  |лНЫМНЯРЭ|   яХМУП.   |
 ;  ЙНМЯРЮМР	|  ОПХБНДЮ  |	   |ГЮДБХФ.|  юд	  |		   |  ЯЙНПНЯРЭ  |
 ;---------------------------------------------------------------------------
 .def _drive1   ;   100 Nm,  i=52.4,  A-25, юхл-ю63б4,  0.37ЙбР, 1500 НА/ЛХМ|
													|
;----------------------------------------------------------------------------
; 
_drive1			;100 Nm,  i=52.4,  A-25, юхл-ю63б4,  0.37ЙбР, 1500 НА/ЛХМ
 .word 1		;1.  лнлемр рнй 0_0
 .word 75		;2.  лнлемр рнй 0_1
 .word 105		;3.  лнлемр рнй 0_2
 .word 130		;4.  лнлемр рнй 0_3
 .word 130		;5.  лнлемр рнй 0_4
 .word 190		;6.  лнлемр рнй 0_5
 .word 5		;7.  лнлемр рнй 1_0
 .word 50		;8.  лнлемр рнй 1_1
 .word 90		;9.  лнлемр рнй 1_2
 .word 176		;10.  лнлемр рнй 1_3
 .word 175		;11. лнлемр рнй 1_4
  .word 210		;12. лнлемр рнй 1_5
 .word 10		;13. лнлемр рнй 2_0
 .word 80		;14. лнлемр рнй 2_1
 .word 140		;15. лнлемр рнй 2_2
 .word 180		;16. лнлемр рнй 2_3
 .word 200		;17. лнлемр рнй 2_4
 .word 300		;18. лнлемр рнй 2_5
 .word 15		;19. лнлемр рнй 3_0
 .word 100		;20. лнлемр рнй 3_1
 .word 175		;21. лнлемр рнй 3_2
 .word 240		;22. лнлемр рнй 3_3
 .word 280		;23. лнлемр рнй 3_4
  .word 350		;24. лнлемр рнй 3_5
 .word 70		;25. лнлемр сцнк 0_0
 .word 50		;26. лнлемр сцнк 0_1
 .word 40		;27. лнлемр сцнк 0_2
 .word 10		;28. лнлемр сцнк 0_3
 .word 1		;29. лнлемр сцнк 0_4
 .word 1		;30. лнлемр сцнк 0_5
 .word 70		;31. лнлемр сцнк 1_0
 .word 50		;32. лнлемр сцнк 1_1
 .word 40		;33. лнлемр сцнк 1_2
 .word 20		;34. лнлемр сцнк 1_3
 .word 10		;35. лнлемр сцнк 1_4
 .word 10		;36. лнлемр сцнк 1_5
 .word 115		;37. лнлемр сцнк 2_0
 .word 70		;38. лнлемр сцнк 2_1
 .word 50		;39. лнлемр сцнк 2_2
 .word 30		;40. лнлемр сцнк 2_3
 .word 15		;41. лнлемр сцнк 2_4
 .word 15		;42. лнлемр сцнк 2_5
 .word 115		;43. лнлемр сцнк 3_0
 .word 70		;44. лнлемр сцнк 3_1
 .word 50		;45. лнлемр сцнк 3_2
 .word 30		;46. лнлемр сцнк 3_3
 .word 15		;47. лнлемр сцнк 3_4
 .word 15		;48. лнлемр сцнк 3_5
 .word 90		;49. сцнк яхтс 0_0
 .word 86		;50. сцнк яхтс 0_1
 .word 77		;51. сцнк яхтс 0_2
 .word 67		;52. сцнк яхтс 0_3
 .word 58		;53. сцнк яхтс 0_4
  .word 50		;54. сцнк яхтс 0_5
 .word 95		;55. сцнк яхтс 1_0
 .word 92		;56. сцнк яхтс 1_1
 .word 86		;57. сцнк яхтс 1_2
 .word 76		;58. сцнк яхтс 1_3
 .word 64		;59. сцнк яхтс 1_4
  .word 58		;60. сцнк яхтс 1_5
 .word 98		;61. сцнк яхтс 2_0
 .word 96		;62. сцнк яхтс 2_1
 .word 90		;63. сцнк яхтс 2_2
 .word 84		;64. сцнк яхтс 2_3
 .word 72		;65. сцнк яхтс 2_4
  .word 65		;66. сцнк яхтс 2_5
 .word 101		;67. сцнк яхтс 3_0
 .word 99		;68. сцнк яхтс 3_1
 .word 92		;69. сцнк яхтс 3_2
 .word 86		;70. сцнк яхтс 3_3
 .word 74		;71. сцнк яхтс 3_4
 .word 68		;72. сцнк яхтс 3_5


